`ሀ = 380፤
ለ = 300፤


ወረቀት(ሀ ፣ ለ)፤


ሰ = ሀ/2፤
መ = 1፤
አንቀሳቅስ = ስራ() {
	ፍሬም(አንቀሳቅስ)፤
    አጥፋ(0፣ 0፣ ሀ፣ ለ)፤
    አስምር(222፣ 111፣ 0፣ 0.8)፤
	ክብ(ሰ፣ ለ/2፣ 30)፤
    
	ከሆነ (ሰ + 30 > ሀ){
    	መ = መ - (መ*2)፤
	}፤
    ከሆነ (ሰ - 30 < 0){
    	መ = መ - (መ*2)፤
	}፤
    ሰ = ሰ + መ፤
  	}፤

አንቀሳቅስ()፤`;

`
ሀ = 380፤
ለ = 300፤


ወረቀት(ሀ ፣ ለ)፤


ሰ = ሀ/2፤
መ = 1፤
አንቀሳቅስ = ስራ() {
	ፍሬም(አንቀሳቅስ)፤
    አስምር(222፣ 111፣ 0፣ 0.8)፤
	ክብ(የት_አግድም፣ የት_ሽቅብ፣ 30)፤

}፤

አንቀሳቅስ()፤
`;

`

ሰልፍ = ጃስ "function(k) {
	k([].slice.call(arguments, 1));
};"
ስንት =  ጃስ "function(k, thing) {
	k(thing.length);
};"
ሰልፍ_የት =  ጃስ "function(k, array, index) {
	k(array[index]);
};"
ሰልፍ_ቀይር =  ጃስ "function(k, array, index, newValue) {
	k((array[index] = newValue));
};"
`;
